_posts/2016-05-11-How_to_call_a_overrided_parent_method.org.html
---
layout: post
title: How To Call A Overrided Parent Method
---

<div id="outline-container-org0310872" class="outline-2">
<h2 id="org0310872"><span class="section-number-2">1</span> In Ruby</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-orge12bf2b" class="outline-3">
<h3 id="orge12bf2b"><span class="section-number-3">1.1</span> Bind &amp; Call</h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #d1f1a9;">class</span> <span style="color: #bbdaff;">Parent</span>
  <span style="color: #d1f1a9;">def</span> <span style="color: #ffc58f;">callee</span>
    <span style="color: #ebbbff;">puts</span> <span style="color: #99ffff;">'parent method'</span>
  <span style="color: #d1f1a9;">end</span>
<span style="color: #d1f1a9;">end</span>

<span style="color: #d1f1a9;">class</span> <span style="color: #bbdaff;">Child</span> &lt; <span style="color: #bbdaff;">Parent</span>
  <span style="color: #d1f1a9;">def</span> <span style="color: #ffc58f;">callee</span>
    <span style="color: #ebbbff;">puts</span> <span style="color: #99ffff;">'child method'</span>
  <span style="color: #d1f1a9;">end</span>

  <span style="color: #d1f1a9;">def</span> <span style="color: #ffc58f;">caller</span>
    <span style="color: #bbdaff;">Parent</span>.instance_method(<span style="color: #bbdaff;">:callee</span>).bind(<span style="color: #d1f1a9;">self</span>).call
  <span style="color: #d1f1a9;">end</span>
<span style="color: #d1f1a9;">end</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgbdfaa6d" class="outline-3">
<h3 id="orgbdfaa6d"><span class="section-number-3">1.2</span> Method alias</h3>
<div class="outline-text-3" id="text-1-2">
<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #d1f1a9;">class</span> <span style="color: #bbdaff;">Parent</span>
  <span style="color: #d1f1a9;">def</span> <span style="color: #ffc58f;">callee</span>
    <span style="color: #ebbbff;">puts</span> <span style="color: #99ffff;">'parent method'</span>
  <span style="color: #d1f1a9;">end</span>
<span style="color: #d1f1a9;">end</span>

<span style="color: #d1f1a9;">class</span> <span style="color: #bbdaff;">Child</span> &lt; <span style="color: #bbdaff;">Parent</span>
  <span style="color: #d1f1a9;">alias</span> parent_callee callee

  <span style="color: #d1f1a9;">def</span> <span style="color: #ffc58f;">callee</span>
    <span style="color: #ebbbff;">puts</span> <span style="color: #99ffff;">'child method'</span>
  <span style="color: #d1f1a9;">end</span>

  <span style="color: #d1f1a9;">def</span> <span style="color: #ffc58f;">caller</span>
    parent_callee
  <span style="color: #d1f1a9;">end</span>
<span style="color: #d1f1a9;">end</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org09cfc65" class="outline-3">
<h3 id="org09cfc65"><span class="section-number-3">1.3</span> Super method (ruby 2.2)</h3>
<div class="outline-text-3" id="text-1-3">
<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #d1f1a9;">class</span> <span style="color: #bbdaff;">Parent</span>
  <span style="color: #d1f1a9;">def</span> <span style="color: #ffc58f;">callee</span>
    <span style="color: #ebbbff;">puts</span> <span style="color: #99ffff;">'parent method'</span>
  <span style="color: #d1f1a9;">end</span>
<span style="color: #d1f1a9;">end</span>

<span style="color: #d1f1a9;">class</span> <span style="color: #bbdaff;">Child</span> &lt; <span style="color: #bbdaff;">Parent</span>
  <span style="color: #d1f1a9;">def</span> <span style="color: #ffc58f;">callee</span>
    <span style="color: #ebbbff;">puts</span> <span style="color: #99ffff;">'child method'</span>
  <span style="color: #d1f1a9;">end</span>

  <span style="color: #d1f1a9;">def</span> <span style="color: #ffc58f;">caller</span>
    method(<span style="color: #bbdaff;">:callee</span>).super_method.call
  <span style="color: #d1f1a9;">end</span>
<span style="color: #d1f1a9;">end</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org25ef294" class="outline-2">
<h2 id="org25ef294"><span class="section-number-2">2</span> In Java</h2>
<div class="outline-text-2" id="text-2">
<div class="org-src-container">
<pre class="src src-java"><span style="color: #d1f1a9;">abstract</span> <span style="color: #d1f1a9;">class</span> <span style="color: #bbdaff;">Parent</span> {
    <span style="color: #d1f1a9;">public</span> <span style="color: #bbdaff;">void</span> <span style="color: #ffc58f;">callee</span>() {
        System.out.println(<span style="color: #99ffff;">"parent method"</span>);
    }
}

<span style="color: #d1f1a9;">class</span> <span style="color: #bbdaff;">Child</span> <span style="color: #d1f1a9;">extends</span> <span style="color: #bbdaff;">Parent</span> {
    <span style="color: #bbdaff;">@Override</span>
    <span style="color: #d1f1a9;">public</span> <span style="color: #bbdaff;">void</span> <span style="color: #ffc58f;">callee</span>() {
        System.out.println(<span style="color: #99ffff;">"child method"</span>);
    }

    <span style="color: #d1f1a9;">public</span> <span style="color: #bbdaff;">void</span> <span style="color: #ffc58f;">caller</span>() {
        <span style="color: #d1f1a9;">super</span>.callee();
    }
}

<span style="color: #d1f1a9;">public</span> <span style="color: #d1f1a9;">class</span> <span style="color: #bbdaff;">App</span> {
    <span style="color: #d1f1a9;">public</span> <span style="color: #d1f1a9;">static</span> <span style="color: #bbdaff;">void</span> <span style="color: #ffc58f;">main</span>(<span style="color: #bbdaff;">String</span>[] <span style="color: #ffeead;">args</span>) {
        <span style="color: #d1f1a9;">new</span> <span style="color: #bbdaff;">Child</span>().caller();
    }
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org5f9db2f" class="outline-2">
<h2 id="org5f9db2f"><span class="section-number-2">3</span> In Scala</h2>
<div class="outline-text-2" id="text-3">
<div class="org-src-container">
<pre class="src src-scala"><span style="color: #d1f1a9;">trait</span> <span style="color: #bbdaff;">Parent</span> {
  <span style="color: #d1f1a9;">def</span> <span style="color: #ffc58f;">callee</span><span style="color: #d1f1a9;">:</span> <span style="color: #bbdaff;">Unit</span> <span style="color: #d1f1a9;">=</span> println <span style="color: #99ffff;">"parent method"</span>
}

<span style="color: #d1f1a9;">class</span> <span style="color: #bbdaff;">Child</span> <span style="color: #d1f1a9;">extends</span> <span style="color: #bbdaff;">Parent</span> {
  <span style="color: #ebbbff;">override</span> <span style="color: #d1f1a9;">def</span> <span style="color: #ffc58f;">callee</span><span style="color: #d1f1a9;">:</span> <span style="color: #bbdaff;">Unit</span> <span style="color: #d1f1a9;">=</span> println <span style="color: #99ffff;">"child method"</span>

  <span style="color: #d1f1a9;">def</span> <span style="color: #ffc58f;">caller</span><span style="color: #d1f1a9;">:</span> <span style="color: #bbdaff;">Unit</span> <span style="color: #d1f1a9;">=</span> <span style="color: #d1f1a9;">super</span>.callee
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org97adbf3" class="outline-2">
<h2 id="org97adbf3"><span class="section-number-2">4</span> In CoffeeScript</h2>
<div class="outline-text-2" id="text-4">
<div class="org-src-container">
<pre class="src src-coffee">class Parent
  callee: -&gt;
    console.log "parent method"

class Child extends Parent
  callee: -&gt;
    console.log "child method"

  caller: -&gt;
    @constructor.__super__.constructor.prototype.callee.call @
</pre>
</div>
</div>
</div>

<div id="outline-container-org9a0c8bd" class="outline-2">
<h2 id="org9a0c8bd"><span class="section-number-2">5</span> In C#</h2>
<div class="outline-text-2" id="text-5">
<div class="org-src-container">
<pre class="src src-csharp"><span style="color: #d1f1a9;">public</span> <span style="color: #d1f1a9;">class</span> <span style="color: #bbdaff;">Parent</span>
{
    <span style="color: #d1f1a9;">public</span> <span style="color: #bbdaff;">void</span> <span style="color: #ffc58f;">Callee</span>()
    {
        Console.WriteLine(<span style="color: #99ffff;">"parent method"</span>);
    }
}

<span style="color: #d1f1a9;">public</span> <span style="color: #d1f1a9;">class</span> <span style="color: #bbdaff;">Child</span>: <span style="color: #bbdaff;">Parent</span>
{
    <span style="color: #d1f1a9;">public</span> <span style="color: #bbdaff;">void</span> <span style="color: #ffc58f;">Callee</span>()
    {
        Console.WriteLine(<span style="color: #99ffff;">"child method"</span>);
    }

    <span style="color: #d1f1a9;">public</span> <span style="color: #bbdaff;">void</span> <span style="color: #ffc58f;">Caller</span>()
    {
        <span style="color: #d1f1a9;">base</span>.Callee();
    }
}
</pre>
</div>
</div>
</div>


<div id="outline-container-org7cdf432" class="outline-2">
<h2 id="org7cdf432"><span class="section-number-2">6</span> In C++</h2>
<div class="outline-text-2" id="text-6">
<div class="org-src-container">
<pre class="src src-c++"><span style="color: #d1f1a9;">class</span> <span style="color: #bbdaff;">Parent</span> {
<span style="color: #d1f1a9;">public</span>:
  <span style="color: #bbdaff;">void</span> <span style="color: #ffc58f;">callee</span>();
};

<span style="color: #bbdaff;">void</span> <span style="color: #bbdaff;">Parent</span>::<span style="color: #ffc58f;">callee</span>() {
  cout &lt;&lt; <span style="color: #99ffff;">"parent method"</span> &lt;&lt; endl;
}

<span style="color: #d1f1a9;">class</span> <span style="color: #bbdaff;">Child</span>: <span style="color: #bbdaff;">Public</span> Parent {
<span style="color: #d1f1a9;">public</span>:
  <span style="color: #bbdaff;">void</span> <span style="color: #ffc58f;">callee</span>();
  <span style="color: #bbdaff;">void</span> <span style="color: #ffc58f;">caller</span>();
};

<span style="color: #bbdaff;">void</span> <span style="color: #bbdaff;">Child</span>::<span style="color: #ffc58f;">callee</span>() {
  cout &lt;&lt; <span style="color: #99ffff;">"child method"</span> &lt;&lt; endl;
}

<span style="color: #bbdaff;">void</span> <span style="color: #bbdaff;">Child</span>::<span style="color: #ffc58f;">caller</span>() {
  <span style="color: #bbdaff;">Parent</span>::callee();
}

<span style="color: #bbdaff;">int</span> <span style="color: #ffc58f;">main</span>()
{
  <span style="color: #bbdaff;">Child</span> *<span style="color: #ffeead;">child</span> = <span style="color: #d1f1a9;">new</span> <span style="color: #bbdaff;">Child</span>();
  child -&gt; caller();
  child -&gt; <span style="color: #bbdaff;">Parent</span>::callee();
}
</pre>
</div>
</div>
</div>


<div id="outline-container-org4b83671" class="outline-2">
<h2 id="org4b83671"><span class="section-number-2">7</span> In Python</h2>
<div class="outline-text-2" id="text-7">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #d1f1a9;">class</span> <span style="color: #bbdaff;">Parent</span>:
    <span style="color: #d1f1a9;">def</span> <span style="color: #ffc58f;">callee</span>(<span style="color: #d1f1a9;">self</span>):
        <span style="color: #d1f1a9;">print</span>(<span style="color: #99ffff;">"parent method"</span>)

<span style="color: #d1f1a9;">class</span> <span style="color: #bbdaff;">Child</span>(Parent):
    <span style="color: #d1f1a9;">def</span> <span style="color: #ffc58f;">callee</span>(<span style="color: #d1f1a9;">self</span>):
        <span style="color: #d1f1a9;">print</span>(<span style="color: #99ffff;">"child method"</span>)

    <span style="color: #d1f1a9;">def</span> <span style="color: #ffc58f;">caller</span>(<span style="color: #d1f1a9;">self</span>):
        <span style="color: #ebbbff;">super</span>(Child, <span style="color: #d1f1a9;">self</span>).callee()
</pre>
</div>
</div>
</div>
